<?php
return array(
	//'配置项'=>'配置值'
    //主题静态文件路径
    'TMPL_PARSE_STRING' => array(
        '__STATIC__' =>  '/Bg/static',),//__ROOT__.'/Background/'.MODULE_NAME.'/View' . 
    'WEB_URL' => 'http://114.80.18.34/bg.php',
	'WEB_FRONT_URL' => 'http://114.80.18.34',
	'WEBSITE_URL' => 'http://web.gl.dev/',
	//'ALIPAY_ACCOUNT' => 'cashier@71360.com',
	
	'OFEIPAY' => array(
		'1' => '成功',
		'5' => '错误的命令',
		'6' => '接口版本错',
		'7' => '接口版本错',
		'8' => '不存在的代理商',
		'9' => '未知错误',
		'10' => '未定义',
		'11' => '运营商地区维护，暂不能充值',
		'12' => '库存不足',
		'1001' => '商户名验证错误',
		'1002' => '商户IP验证错误',
		'1003' => 'MD5串验证错误',
		'1004' => '此商品暂不可用',
		'1005' => '购买的商品数量超出系统要求',
		'1007' => '账户金额不足',
		'1008' => '缺少必需参数',
		'1009' => '会员账户不存在',
		'9999' => '未知错误',
		'305' => '充值失败未知错误',
		'319' => '充值的手机号不正确',
		'320' => '身份证号码格式不正确',
		'321' => '暂时不支持此类手机号的充值',
		'331' => '订单生成失败',
		'334' => '订单生成超时',
		'1043' => '支付超时，订单处理失败',
		'2000' => '订单号不存在',
		'2001' => '该订单已经被处理过了',
		'2010' => '发生错误，订单处理失败',
		'9998' => '参数格式错误',
		'1017' => '卡号卡密验证错误',
		'1018' => '加油卡充值时失败,不生成订单',
		'1990' => '错误的卡类型',
		'1992' => '没有对应的产品',
		'1993' => '错误的回调地址',
		'1994' => '订单不存在',
		'1995' => '不是欧飞订单',
		'1996' => '撤销失败',
		
			
	),
	//极光推送配置
	'JPUSH_CONFIG' => array(
			'app_key' => 'fae05a2b934e82a997c52404',
			'master_secret' => 'e0cdf0bb20fe51dfa299072b',
	),
);